<a href="https://colab.research.google.com/github/ckalibsnelson/HackCville---Node-A/blob/master/02_titanic_pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Working with the Titanic dataset in Pandas

source: https://www.kaggle.com/startupsci/titanic-data-science-solutions

In [0]:
import pandas as pd # import the pandas package

In [0]:
titanic = pd.read_csv('https://gist.githubusercontent.com/aaron-gu/a6f9ad745516e87fc2f2db9aa5520480/raw/e7475bff67f2d82dfd8b34e8516affba678b508c/titanic.csv')
# we read the csv from the github link

The first thing you want to do after you get your data is examine the columns. Which columns are numerical, and which columns are categorical?

- Pclass: class of travel
- SibSp: number of siblings and spouses aboard
- parch: number of parents and children aboard
- ticket: ticket number
- embarked: which port they embarked from (C = Cherbourg, S = Southampton, Q = Queenstown)

In [0]:
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [0]:
titanic.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

Categorical:
- survived
- sex
- embarked
- Pclass

Numerical:
- age
- fare
- SibSp
- Parch

In [0]:
titanic.describe() # very useful method! instantly shows useful stats for numerical columns

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [0]:
titanic.describe(include=['O']) # how to show stats for categorical columns

                             Name   Sex    Ticket        Cabin Embarked
count                         891   891       891          204      889
unique                        891     2       681          147        3
top     Graham, Mr. George Edward  male  CA. 2343  C23 C25 C27        S
freq                            1   577         7            4      644

What information can you get? Explain in English

From this, which columns are irrelevant to our data analysis?

Which columns can we create from existing columns?

## Answering questions about the data

1. Does passenger class have an impact on survival?
2. Does Sex have an impact on survival?
3. Does number of siblings or parents and children impact survival?
4. Does embarking from a different port impact survival?

      a. Does embarking from a different port as a male impact survival?
     
5. Family connections?

### Introducing groupby
 Groups together all data from a dataframe based off of one variable
 
 Returns a groupby object where you specify another variable and function to apply

In [0]:
survivedGroups = titanic.groupby("Survived") #Groupby object 
survivedGroups #Must also supply variable and function in order to summarize data

In [0]:
survivedGroups['Fare'].mean() #Look at the average fare for passengers who survived

Survived
0    22.117887
1    48.395408
Name: Fare, dtype: float64

Did fare price have any relation to survival?

1. Does passenger class have an effect on survival?

In [0]:
classGroups = titanic.groupby('Pclass') # groups all data points together based on Pclass

In [0]:
classGroups['Survived'].mean() # finds the mean value of the Survived of each Pclass group

Pclass
1    0.629630
2    0.472826
3    0.242363
Name: Survived, dtype: float64

2. Does sex have an impact on survival?

In [0]:
sexGroups = titanic.groupby('Sex') # this time groups all data points by sex

In [0]:
sexGroups['Survived'].mean() # and again finds mean of Survival column for each group

Sex
female    0.742038
male      0.188908
Name: Survived, dtype: float64

3. Does number of siblings or parents and children impact survival?

In [0]:
sibGroups = titanic.groupby('SibSp')

In [0]:
sibGroups['Survived'].mean().sort_values(ascending=False)

SibSp
1    0.535885
2    0.464286
0    0.345395
3    0.250000
4    0.166667
8    0.000000
5    0.000000
Name: Survived, dtype: float64

In [0]:
titanic.groupby('Parch')['Survived'].mean().sort_values(ascending=False)

Parch
3    0.600000
1    0.550847
2    0.500000
0    0.343658
5    0.200000
6    0.000000
4    0.000000
Name: Survived, dtype: float64

4. Does embarking from a different port impact survival?

  a. Does embarking from a different port as a male impact survival?

In [0]:
embarkGroups = titanic.groupby('Embarked')

In [0]:
embarkGroups['Survived'].mean()

Embarked
C    0.553571
Q    0.389610
S    0.336957
Name: Survived, dtype: float64

####Grouping by two variables

This organizes the data from multiple' columns and gives us the ability to look at many variables at the same time.

We can now apply one summary function to multiple variables

In [0]:
#This organizes the data from both the 'sex' and 'embarked' columns
#We can look at the survived mean for both groups now (sexes and embarked)
titanic.groupby(['Sex', 'Embarked'])['Survived'].mean() #Grouping by two variables

Sex     Embarked
female  C           0.876712
        Q           0.750000
        S           0.689655
male    C           0.305263
        Q           0.073171
        S           0.174603
Name: Survived, dtype: float64

In [0]:
titanic.groupby(['SibSp', 'Parch'])['Survived'].mean() #Looking at survival rates for both number of siblings and number of parents/children
#Not that great -- not that informative & too many zeros

SibSp  Parch
0      0        0.303538
       1        0.657895
       2        0.724138
       3        1.000000
       4        0.000000
       5        0.000000
1      0        0.520325
       1        0.596491
       2        0.631579
       3        0.333333
       4        0.000000
       5        0.333333
       6        0.000000
2      0        0.250000
       1        0.857143
       2        0.500000
       3        1.000000
3      0        1.000000
       1        0.000000
       2        0.285714
4      1        0.000000
       2        0.333333
5      2        0.000000
8      2        0.000000
Name: Survived, dtype: float64

In [0]:
titanic.groupby(['Age', 'Pclass'])['Survived'].mean().tail(10) #Looking at the survival rate for the passenger class for the oldest passengers

Age   Pclass
64.0  1         0.0
65.0  1         0.0
      3         0.0
66.0  2         0.0
70.0  1         0.0
      2         0.0
70.5  3         0.0
71.0  1         0.0
74.0  3         0.0
80.0  1         1.0
Name: Survived, dtype: float64

###Using get_group()

This lets us gather the data based off of a grouping

In [0]:
titanic.groupby('Sex').get_group("male").head() # Groups dataframe with 'Sex' variable
#Showing the group of males

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S

More With get_group()

In [0]:
titanic.groupby('Survived').get_group(1).head() #Looking at everyone who survived

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

##Exercises 

1. Find the survival rate for both age and sex
2. Find the survial rate for passenger class and fare
3. Find the average fare based off of sex and age

In [0]:
sexages =titanic.groupby(['Sex', 'Age'])['Survived'].mean()

titanic.groupby(['Pclass', 'Fare'])['Survived'].mean()

titanic.groupby(['Sex', 'Age'])['Fare'].mean()

Sex     Age
female  0.75      19.258300
        1.00      13.437500
        2.00      43.245833
        3.00      31.327100
        4.00      22.828340
        5.00      22.717700
        6.00      32.137500
        7.00      26.250000
        8.00      23.662500
        9.00      27.198950
        10.00     24.150000
        11.00     31.275000
        13.00     13.364600
        14.00     42.291675
        14.50     14.454200
        15.00     60.261475
        16.00     41.043750
        17.00     35.130550
        18.00     53.616669
        19.00     30.727986
        20.00      9.243750
        21.00     58.633329
        22.00     37.009033
        23.00     81.108340
        24.00     48.260675
        25.00     44.650000
        26.00     27.345840
        27.00     12.815267
        28.00     15.849400
        29.00     45.802971
                    ...
male    42.00     21.610840
        43.00     13.583333
        44.00     26.020833
        45.00     31.183333
        45.50     17.862500
        46.00     55.458333
        47.00     25.908329
        48.00     35.226680
        49.00     64.229175
        50.00     63.405000
        51.00     20.551400
        52.00     34.162500
        54.00     39.030000
        55.00     30.500000
        55.50      8.050000
        56.00     30.915267
        57.00     12.350000
        58.00     71.487500
        59.00     10.375000
        60.00     48.250000
        61.00     24.019433
        62.00     21.200000
        64.00    144.500000
        65.00     32.093067
        66.00     10.500000
        70.00     40.750000
        70.50      7.750000
        71.00     42.079200
        74.00      7.775000
        80.00     30.000000
Name: Fare, Length: 145, dtype: float64